//Task5

//Напишите 2 функции:

//Первая функция squareNumber(num) должна принимать число, и возвращать квадрат этого числа

//Вторая функция запрашивает у пользователя число от 18 до 50.
//Если пользователь ввел НЕ число, то сделайте ему одно замечание,
//если число, то вызовете функцию squareNumber передав в нее это самое число.
//Необходимо вывести результат пользователю (Либо замечание, либо квадрат числа).

function squareNumber(num) {
  return num ** 2;
}

function user() {
  var num = prompt('Введите пожалуйста число от 18 до 50:');
  if(num >= 18 && num <= 50) {
    console.log(squareNumber(num));
  } else if(num === NaN) {
    console.log('Будьте пожалуйста внимательнее, вы ввели не число. Попробуйте ещё раз!');
  } else {console.log('Вы ввели число не удовлетворяющие условиям. Будьте бдительны! Попробуйте ещё раз!');
  }
}
user();


//Task6



//Task7



//Task8



//Task9

